rotations_I = [
    [(2, 0), (2, 1), (2, 2), (2, 3)],  # מצב 0° - אופקי
    [(0, 1), (1, 1), (2, 1), (3, 1)]   # מצב 90° - אנכי
]

rotations_O = [
    [(0, 0), (1, 0), (0, 1), (1, 1)]  # ריבוע - אין שינוי בסיבוב
]

rotations_T = [
    [(1, 0), (0, 1), (1, 1), (2, 1)],  # מצב 0°
    [(1, 0), (1, 1), (2, 1), (1, 2)],  # מצב 90°
    [(0, 1), (1, 1), (2, 1), (1, 2)],  # מצב 180°
    [(1, 0), (0, 1), (1, 1), (1, 2)]   # מצב 270°
]

rotations_S = [
    [(1, 0), (2, 0), (0, 1), (1, 1)],  # מצב 0°
    [(1, 0), (1, 1), (2, 1), (2, 2)],  # מצב 90°
    [(1, 1), (2, 1), (0, 2), (1, 2)],  # מצב 180°
    [(0, 0), (0, 1), (1, 1), (1, 2)]   # מצב 270°
]

rotations_Z = [
    [(0, 0), (1, 0), (1, 1), (2, 1)],  # מצב 0°
    [(2, 0), (1, 1), (2, 1), (1, 2)],  # מצב 90°
    [(0, 1), (1, 1), (1, 2), (2, 2)],  # מצב 180°
    [(1, 0), (0, 1), (1, 1), (0, 2)]   # מצב 270°
]

rotations_L = [
    [(0, 0), (0, 1), (1, 1), (2, 1)],  # מצב 0°
    [(1, 0), (1, 1), (1, 2), (2, 0)],  # מצב 90°
    [(0, 1), (1, 1), (2, 1), (2, 2)],  # מצב 180°
    [(0, 2), (1, 0), (1, 1), (1, 2)]   # מצב 270°
]

rotations_J = [
    [(2, 0), (0, 1), (1, 1), (2, 1)],  # מצב 0°
    [(1, 0), (1, 1), (1, 2), (2, 2)],  # מצב 90°
    [(0, 1), (1, 1), (2, 1), (0, 2)],  # מצב 180°
    [(0, 0), (1, 0), (1, 1), (1, 2)]   # מצב 270°
]

tetromino_shapes = [
    {"name": "I", "rotations": rotations_I, "color": (0, 255, 255)}, # Cyan
    {"name": "O", "rotations": rotations_O, "color": (255, 255, 0)}, # Yellow
    {"name": "T", "rotations": rotations_T, "color": (128, 0, 128)}, # Purple
    {"name": "S", "rotations": rotations_S, "color": (0, 255, 0)}, # Green
    {"name": "Z", "rotations": rotations_Z, "color": (255, 0, 0)}, # Red
    {"name": "L", "rotations": rotations_L, "color": (255, 165, 0)}, # Orange
    {"name": "J", "rotations": rotations_J, "color": (0, 0, 255)} # Blue
]
